IDENTIFICATION DIVISION.
PROGRAM-ID. EXAMPLE12-3.

DATA DIVISION.
WORKING-STORAGE SECTION.
01     INPUTSTRING     PIC X(8).

01     WORKAREA.
       02  FNUM        PIC 9(5) VALUE ZEROS.
       02  SNUM        PIC 99   VALUE ZEROS.
01     WORKNUM REDEFINES WORKAREA PIC 99999V99.

01     EDITEDNUM       PIC ZZ,ZZ9.99.

PROCEDURE DIVISION.
BEGIN.
       DISPLAY "ENTER A DECIMAL NUMBER - " WITH NO ADVANCING
       ACCEPT INPUTSTRING
       UNSTRING INPUTSTRING DELIMITED BY "." INTO FNUM, SNUM
           
       MOVE WORKNUM TO EDITEDNUM
       DISPLAY "DECIMAL NUMBER = " EDITEDNUM
       ADD 10 TO WORKNUM
       MOVE WORKNUM TO EDITEDNUM
       DISPLAY "DECIMAIL NUMBER = " EDITEDNUM
       STOP RUN.
