IDENTIFICATION DIVISION.
PROGRAM-ID. EXAMPLE12-5.

DATA DIVISION.
WORKING-STORAGE SECTION.
01     NANOSECS    PIC 9(10).
01     MICROSECS   REDEFINES NANOSECS PIC 9999999V999.
01     MILLISECS   REDEFINES NANOSECS PIC 9999V999999.
01     SECONDS     REDEFINES NANOSECS PIC 9V999999999.

01     EDITEDNUM   PIC Z,ZZZ,ZZZ,ZZ9.99.

PROCEDURE DIVISION.
BEGIN.
       MOVE 1234567895 TO NANOSECS
       MOVE NANOSECS TO EDITEDNUM
       DISPLAY EDITEDNUM " NANOSECS"
       
       MOVE MICROSECS TO EDITEDNUM
       DISPLAY EDITEDNUM " MICROSECS"

       MOVE MILLISECS TO EDITEDNUM
       DISPLAY EDITEDNUM " MILLISECS"

       MOVE SECONDS TO EDITEDNUM
       DISPLAY EDITEDNUM " SECONDS"
       STOP RUN.
