IDENTIFICATION DIVISION.
PROGRAM-ID. LISTING7-4.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
       SELECT STOCKFILE ASSIGN TO "GadgetStock.dat"
           ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD     STOCKFILE.
01     STOCKREC.
       88  ENDOFSTOCKFILE VALUE HIGH-VALUES.
       02  GADGETID    PIC 9(6).
       02  GADGETNAME  PIC X(30).
       02  QTYINSTOCK  PIC 9(4).
       02  PRICE       PIC 9(4)V99.

WORKING-STORAGE SECTION.
01     STOCKTOTAL      PIC 9(6)V99 VALUE ZEROS.
01     QTYINSTOCKTOTAL PIC 9(6)V99 VALUE ZEROS.
PROCEDURE DIVISION.

BEGIN.
       OPEN INPUT STOCKFILE.
       READ STOCKFILE AT END SET ENDOFSTOCKFILE TO TRUE
       END-READ

       PERFORM UNTIL ENDOFSTOCKFILE
           MULTIPLY QTYINSTOCK BY PRICE GIVING QTYINSTOCKTOTAL
           ADD QTYINSTOCKTOTAL TO STOCKTOTAL
           DISPLAY GADGETNAME " " QTYINSTOCKTOTAL
           READ STOCKFILE AT END SET ENDOFSTOCKFILE TO TRUE
           END-READ
       END-PERFORM
       CLOSE STOCKFILE.

       DISPLAY "STOCK TOTAL:" STOCKTOTAL
       STOP RUN.
