IDENTIFICATION DIVISION.
PROGRAM-ID. LISTING13-1.

DATA DIVISION.
WORKING-STORAGE SECTION.
01     LETTERTABLE.
       02  TABLEVALUES.
           03 FILLER   PIC X(13)
               VALUE "ABCDEFGHIJKLM".
           03 FILLER   PIC X(13)
               VALUE "NOPQRSTUVWXYZ".
       02  FILLER REDEFINES TABLEVALUES.
           03 LETTER   PIC X OCCURS 26 TIMES INDEXED BY LETTERIDX.

01     IDXVALUE        PIC 99 VALUE ZEROS.

01     LETTERIN        PIC X.
       88  VALIDLETTER VALUE "A" THRU "Z".

PROCEDURE DIVISION.
FINDALPHABETLETTERPOSITION.
       PERFORM WITH TEST AFTER UNTIL VALIDLETTER
           DISPLAY "ENTER AN UPPERCASE LETTER PLEASE - " WITH NO ADVANCING
           ACCEPT LETTERIN
       END-PERFORM
       SET LETTERIDX TO 1
       SEARCH LETTER
           WHEN LETTER(LETTERIDX) = LETTERIN
               SET IDXVALUE TO LETTERIDX
               DISPLAY LETTERIN, " IS IN POSITION ", IDXVALUE
       END-SEARCH
       STOP RUN.
