IDENTIFICATION DIVISION.
PROGRAM-ID. LISTING14-2.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
       SELECT WORKFILE ASSIGN TO "Work.tmp".

       SELECT BILLABLESERVICEFILE ASSIGN TO "Listing14-1.dat"
           ORGANIZATION IS LINE SEQUENTIAL.

       SELECT SORTEDSUBSCRIBERFILE ASSIGN TO "Listing14-3.srt"
           ORGANIZATION IS LINE SEQUENTIAL.

       SELECT PRINTFILE ASSIGN TO "Listing14-3.prn"
           ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.

FD     BILLABLESERVICEFILE.
01     SUBSCRIBERREC-BSF.
       88 ENDOFBILLABLESERVICEFILE VALUE HIGH-VALUES.
       02 SUBSCRIBERID-BSF         PIC 9(10).
       02 SERVICETYPE-BSF          PIC 9.
       02 FILLER                   PIC X(6).

SD     WORKFILE.
01     WORKREC.
       02  SUBSCRIBERID-WF         PIC 9(10).
       02  SERVICETYPE-WF          PIC 9.

FD     SORTEDSUBSCRIBERFILE.
01     SUBSCRIBERREC.
       88  ENDOFBILLABLESFILE      VALUE HIGH-VALUES.
       02  SUBSCRIBERID            PIC 9(10).
       02  SERVICETYPE             PIC 9.
          88 VOICECALL             VALUE 2.           

FD     PRINTFILE.
01     PRINTREC                    PIC X(40).

WORKING-STORAGE SECTION.
01     CALLSTOTAL                  PIC 9(4).
01     TEXTSTOTAL                  PIC 9(5).

01     REPORTHEADER                PIC X(33) VALUE "UNIVERSAL TELECOMS MONTHLY REPORT".

01     SUBJECTHEADER               PIC X(31) VALUE "SUBSCRIBERID     CALLS    TEXTS".

01     SUBSCRIBERLINE.
       02  PRNSUBSCRIBERID         PIC 9(10).
       02  FILLER                  PIC X(6) VALUE SPACES.
       02  PRNCALLSTOTAL           PIC Z,ZZ9.
       02  FILLER                  PIC X(4) VALUE SPACES.
       02  PRNTEXTSTOTAL           PIC ZZ,ZZ9.

01     PREVSUBSCRIBERID            PIC 9(10).

PROCEDURE DIVISION.
BEGIN.
       SORT WORKFILE ON ASCENDING KEY SUBSCRIBERID-WF
           INPUT PROCEDURE IS MODIFYSUBSCRIBERRECORDS
           GIVING SORTEDSUBSCRIBERFILE
       OPEN OUTPUT PRINTFILE
       OPEN INPUT SORTEDSUBSCRIBERFILE
       WRITE PRINTREC FROM REPORTHEADER AFTER ADVANCING 1 LINE
       WRITE PRINTREC FROM SUBJECTHEADER AFTER ADVANCING 1 LINE
       READ SORTEDSUBSCRIBERFILE AT END SET ENDOFBILLABLESFILE TO TRUE
       END-READ
       PERFORM UNTIL ENDOFBILLABLESFILE
           MOVE SUBSCRIBERID TO PREVSUBSCRIBERID, PRNSUBSCRIBERID
           MOVE ZEROS TO CALLSTOTAL, TEXTSTOTAL
           PERFORM UNTIL SUBSCRIBERID NOT EQUAL TO PREVSUBSCRIBERID
               IF VOICECALL ADD 1 TO CALLSTOTAL
                   ELSE ADD 1 TO TEXTSTOTAL
               END-IF
               READ SORTEDSUBSCRIBERFILE AT END SET ENDOFBILLABLESFILE TO TRUE
               END-READ
           END-PERFORM
           MOVE CALLSTOTAL TO PRNCALLSTOTAL
           MOVE TEXTSTOTAL TO PRNTEXTSTOTAL
           WRITE PRINTREC FROM SUBSCRIBERLINE AFTER ADVANCING 1 LINE
       END-PERFORM
       CLOSE SORTEDSUBSCRIBERFILE, PRINTFILE
       STOP RUN.

MODIFYSUBSCRIBERRECORDS.
       OPEN INPUT BILLABLESERVICEFILE
       READ BILLABLESERVICEFILE AT END SET ENDOFBILLABLESERVICEFILE TO TRUE
       END-READ
       PERFORM UNTIL ENDOFBILLABLESERVICEFILE
           MOVE SUBSCRIBERID-BSF TO SUBSCRIBERID-WF
           MOVE SERVICETYPE-BSF  TO SERVICETYPE-WF
           RELEASE WORKREC
           READ BILLABLESERVICEFILE AT END SET ENDOFBILLABLESERVICEFILE TO TRUE
           END-READ
       END-PERFORM
       CLOSE BILLABLESERVICEFILE.
