IDENTIFICATION DIVISION.
PROGRAM-ID. LISTING14-6.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.

       SELECT UNSORTEDSTUDENTSFILE ASSIGN TO "Listing14-6.dat"
           ORGANIZATION IS LINE SEQUENTIAL.

       SELECT WORKFILE ASSIGN TO "Workfile.tmp".
           
       SELECT SORTEDSTUDENTSFILE ASSIGN TO "Listing14-6.srt"
           ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD     UNSORTEDSTUDENTSFILE.
01     STUDENTRECUF.
       88  ENDOFUNSORTEDFILE           VALUE HIGH-VALUES.
       02  STUDENTIDUF.
           03  MILLENNIUMUF            PIC 99.
           03  FILLER                  PIC 9(5).
       02  RECBODYUF                   PIC X(14).

SD     WORKFILE.
01     STUDENTRECWF.
       88  ENDOFWORKFILE               VALUE HIGH-VALUES.
       02  FULLSTUDENTIDWF.
           03  MILLENNIUMWF            PIC 99.
           03  STUDENTIDWF             PIC 9(7).
       03  RECBODYWF                   PIC X(14).

FD     SORTEDSTUDENTSFILE.
01     STUDENTRECSF.
       02  STUDENTIDSF                 PIC 9(7).
       02  RECBODYSF                   PIC X(14).

PROCEDURE DIVISION.
BEGIN.
       SORT WORKFILE ON ASCENDING KEY FULLSTUDENTIDWF
           INPUT PROCEDURE IS ADDINMILLENNIUM
           OUTPUT PROCEDURE IS REMOVEMILLENNIUM
       STOP RUN.

ADDINMILLENNIUM.
       OPEN INPUT UNSORTEDSTUDENTSFILE
       READ UNSORTEDSTUDENTSFILE AT END SET ENDOFUNSORTEDFILE TO TRUE
       END-READ
       PERFORM UNTIL ENDOFUNSORTEDFILE
           MOVE RECBODYUF TO RECBODYWF
           MOVE STUDENTIDUF TO STUDENTIDWF
           IF MILLENNIUMUF < 70
               MOVE 20 TO MILLENNIUMWF
           ELSE
               MOVE 19 TO MILLENNIUMWF
           END-IF
           RELEASE STUDENTRECWF
           READ UNSORTEDSTUDENTSFILE AT END SET ENDOFUNSORTEDFILE TO TRUE
           END-READ
       END-PERFORM
       CLOSE UNSORTEDSTUDENTSFILE.

REMOVEMILLENNIUM.
       OPEN OUTPUT SORTEDSTUDENTSFILE
       RETURN WORKFILE AT END SET ENDOFWORKFILE TO TRUE
       END-RETURN
       PERFORM UNTIL ENDOFWORKFILE
           MOVE RECBODYWF  TO RECBODYSF
           MOVE STUDENTIDWF TO STUDENTIDSF
           WRITE STUDENTRECSF
           RETURN WORKFILE AT END SET ENDOFWORKFILE TO TRUE
           END-RETURN
       END-PERFORM
       CLOSE SORTEDSTUDENTSFILE.
