IDENTIFICATION DIVISION.
PROGRAM-ID. LISTING11-1.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
       SELECT BRANCHSALESFILE ASSIGN TO "BranchSales2.dat"
           ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD     BRANCHSALESFILE.
01     BRANCHSALESREC.
       88 ENDOFSALESFILE   VALUE HIGH-VALUES.
       02 BRANCHID         PIC 9(7).
       02 STATENUM         PIC 99.
       02 CANDYSALES       PIC 9(7)V99.

WORKING-STORAGE SECTION.
01     STATESALESTABLE.
       02 STATESALESTOTAL  PIC 9(8)V99     OCCURS 50 TIMES.

01     STATEIDX            PIC 99.
01     PRNSTATESALES       PIC $$$,$$$,$$9.99.

PROCEDURE DIVISION.
BEGIN.
       MOVE ZEROS TO STATESALESTABLE
       OPEN INPUT BRANCHSALESFILE
       READ BRANCHSALESFILE
           AT END SET ENDOFSALESFILE TO TRUE
       END-READ
       PERFORM UNTIL ENDOFSALESFILE
           ADD CANDYSALES TO STATESALESTOTAL(STATENUM)
           READ BRANCHSALESFILE
               AT END SET ENDOFSALESFILE TO TRUE
           END-READ
       END-PERFORM
       DISPLAY "    CANDYSHOPPE SALES BY STATE"
       DISPLAY "    --------------------------"
       PERFORM VARYING STATEIDX FROM 1 BY 1
               UNTIL STATEIDX GREATER THAN 50
           MOVE STATESALESTOTAL(STATEIDX) TO PRNSTATESALES
           DISPLAY "STATE " STATEIDX
                   " SALES TOTAL IS " PRNSTATESALES
       END-PERFORM
       CLOSE BRANCHSALESFILE
       STOP RUN.
