IDENTIFICATION DIVISION.
PROGRAM-ID. LISTING6-4.

DATA DIVISION.
WORKING-STORAGE SECTION.
01     COUNTERS.
       02  HUNDREDSCOUNT   PIC 99  VALUE   ZEROS.
       02  TENSCOUNT       PIC 99  VALUE   ZEROS.
       02  UNITSCOUNT      PIC 99  VALUE   ZEROS.

01     ODOMETER.
       02  PRNHUNDREDS     PIC 9.
       02  FILLER          PIC X   VALUE   "-".
       02  PRNTENS         PIC 9.
       02  FILLER          PIC X   VALUE   "-".
       02  PRNUNITS        PIC 9.

PROCEDURE DIVISION.
BEGIN. 
       DISPLAY "USING AN OUT-OF-LINE PERFORM".
       PERFORM COUNTMILEAGE
           VARYING HUNDREDSCOUNT FROM 0 BY 1 UNTIL HUNDREDSCOUNT > 9
           AFTER   TENSCOUNT     FROM 0 BY 1 UNTIL TENSCOUNT > 9
           AFTER   UNITSCOUNT    FROM 0 BY 1 UNTIL UNITSCOUNT > 9
       
       DISPLAY "NOW USING IN-LINE PERFORM"
       PERFORM VARYING HUNDREDSCOUNT FROM 0 BY 1 UNTIL HUNDREDSCOUNT > 9
           PERFORM VARYING TENSCOUNT     FROM 0 BY 1 UNTIL TENSCOUNT > 9
               PERFORM VARYING UNITSCOUNT    FROM 0 BY 1 UNTIL UNITSCOUNT > 9
                   MOVE HUNDREDSCOUNT TO PRNHUNDREDS
                   MOVE TENSCOUNT     TO PRNTENS
                   MOVE UNITSCOUNT    TO PRNUNITS
                   DISPLAY "IN - " ODOMETER
               END-PERFORM
           END-PERFORM
       END-PERFORM

       DISPLAY "END OF ODOMETER SIMULATION"
       STOP RUN.

COUNTMILEAGE.
       MOVE HUNDREDSCOUNT TO PRNHUNDREDS
       MOVE TENSCOUNT     TO PRNTENS
       MOVE UNITSCOUNT    TO PRNUNITS
       DISPLAY "OUT - " ODOMETER.
