IDENTIFICATION DIVISION.
PROGRAM-ID. LISTING8-1.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
       SELECT SHOPRECEIPTSFILE ASSIGN TO "Listing8-1-ShopSales.dat"
            ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD     SHOPRECEIPTSFILE.
01     SHOPDETAILS.
       88 ENDOFSHOPRECEIPTSFILE    VALUE HIGH-VALUES.
       02 RECTYPECODE      PIC X.
           88  SHOPHEADER  VALUE "H".
           88  SHOPSALE    VALUE "S".
       02 SHOPID           PIC X(5).
       02 SHOPLOCATION     PIC X(30).
01     SALERECEIPT.
       02 RECTYPECODE      PIC X.
       02 ITEMID           PIC X(8).
       02 QTYSOLD          PIC 9(3).
       02 ITEMCOST         PIC 999V99.

WORKING-STORAGE SECTION.
01     PRNSHOPSALESTOTAL.
       02 FILLER       PIC X(21) VALUE "TOTAL SALES FOR SHOP ".
       02 PRNSHOPID    PIC X(5).
       02 PRNSHOPTOTAL PIC $$$$,$$9.99.

01     SHOPTOTAL       PIC 9(5)V99.

PROCEDURE DIVISION.
SHOPSALESSUMMARY.
       OPEN INPUT SHOPRECEIPTSFILE
       READ SHOPRECEIPTSFILE
           AT END SET ENDOFSHOPRECEIPTSFILE TO TRUE
       END-READ
       PERFORM SUMMARIZECONTRYSALES
           UNTIL ENDOFSHOPRECEIPTSFILE
       CLOSE SHOPRECEIPTSFILE
       STOP RUN.

SUMMARIZECONTRYSALES.
       MOVE SHOPID TO PRNSHOPID
       MOVE ZEROS TO SHOPTOTAL
       READ SHOPRECEIPTSFILE
           AT END SET ENDOFSHOPRECEIPTSFILE TO TRUE
       END-READ
       PERFORM SUMMARIZESHOPSALES
           UNTIL SHOPHEADER OR ENDOFSHOPRECEIPTSFILE
       MOVE SHOPTOTAL TO PRNSHOPTOTAL
       DISPLAY PRNSHOPSALESTOTAL.

SUMMARIZESHOPSALES.
       COMPUTE SHOPTOTAL = SHOPTOTAL + (QTYSOLD * ITEMCOST)
       READ SHOPRECEIPTSFILE
           AT END SET ENDOFSHOPRECEIPTSFILE TO TRUE
       END-READ.
