IDENTIFICATION DIVISION.
PROGRAM-ID. Listing5-10.
AUTHOR. MICHEAL COUGHLAN.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 PLAYERGUESS-A   PIC 9   VALUE 1.
       88 ROCK-A        VALUE 1.
       88 PAPER-A       VALUE 2.
       88 SCISSORS-A    VALUE 3.
01 PLAYERGUESS-B   PIC 9   VALUE 1.
       88 ROCK-B        VALUE 1.
       88 PAPER-B       VALUE 2.
       88 SCISSORS-B    VALUE 3.

01 WINNER          PIC X VALUE SPACE.

PROCEDURE DIVISION.
BEGIN.
       DISPLAY "GUESS FOR PLAYER A (1=ROCK, 2=PAPER, 3=SCISSORS) : "
           WITH NO ADVANCING
        ACCEPT PLAYERGUESS-A
       DISPLAY "GUESS FOR PLAYER B (1=ROCK, 2=PAPER, 3=SCISSORS) : "
           WITH NO ADVANCING
        ACCEPT PLAYERGUESS-B

        EVALUATE   TRUE        ALSO TRUE
           WHEN    ROCK-A      ALSO PAPER-B MOVE "B" TO WINNER
           WHEN    ROCK-A      ALSO SCISSORS-B MOVE "A" TO WINNER
           WHEN    PAPER-A     ALSO ROCK-B MOVE "A" TO WINNER
           WHEN    PAPER-A     ALSO SCISSORS-B MOVE "B" TO WINNER
           WHEN    SCISSORS-A  ALSO ROCK-B MOVE "B" TO WINNER
           WHEN    SCISSORS-A  ALSO PAPER-B MOVE "A" TO WINNER
       END-EVALUATE

       IF WINNER = SPACE
           DISPLAY "PAIR"
       ELSE
           DISPLAY "WINNER IS " WINNER
       STOP RUN.
