IDENTIFICATION DIVISION.
PROGRAM-ID. LISTING16-2.

DATA DIVISION.
WORKING-STORAGE SECTION.
01     STUDENTID               PIC 9(7).

01     VALIDATIONRESULT        PIC 9.
       88  VALIDSTUDENTID      VALUE ZERO.
       88  INVALIDSTUDENTID    VALUE 1.

PROCEDURE DIVISION.
BEGIN.
       PERFORM 3 TIMES
           DISPLAY "ENTER A STUDENT ID: " WITH NO ADVANCING
           ACCEPT STUDENTID
           CALL "VALIDATECHECKDIGIT" USING BY CONTENT STUDENTID
                                           BY REFERENCE VALIDATIONRESULT
           IF VALIDSTUDENTID
               DISPLAY "THE STUDENT ID - " STUDENTID " - IS VALID"
           ELSE
               DISPLAY "THE STUDENT ID - " STUDENTID " - IS NOT VALID"
           END-IF
           DISPLAY SPACES
       END-PERFORM
       STOP RUN.
