IDENTIFICATION DIVISION.
PROGRAM-ID. LISTING13-3.

DATA DIVISION.
WORKING-STORAGE SECTION.
01     MYTIMETABLE.
       02  DAYOFAPP OCCURS 5 TIMES INDEXED BY DAYIDX.
           03  HOUROFAPP OCCURS 9 TIMES INDEXED BY HOURIDX.
               04  APPOINTMENT         PIC X(15).
               04  LOCATION            PIC X(20).

01     APPOINTMENTTYPE                 PIC X(15).

01     DAYSUB                          PIC 9.
01     HOURSUB                         PIC 9.

01     FILLER                          PIC 9 VALUE 0.
       88  APPOINTMENTNOTFOUND         VALUE 0.
       88  APPOINTMENTFOUND            VALUE 1.

01     DAYVALUES   VALUE   "MONTUEWENTHUFRI".
       02  DAYNAME PIC XXX OCCURS 5 TIMES.

01     TIMEVALUES  VALUE   " 9:0010:0011:0012:0013:0014:0015:0016:0017:00".
       02  TIMEVALUE   PIC X(5)    OCCURS 9 TIMES.

PROCEDURE DIVISION.
BEGIN.
       MOVE "PETER'S WEDDING" TO APPOINTMENTTYPE, APPOINTMENT(2,3)
       MOVE "SAINT JOHN'S CHURCH" TO LOCATION(2,3)
       SET DAYIDX TO 1
       PERFORM UNTIL APPOINTMENTFOUND OR DAYIDX > 5
           SET HOURIDX TO 1
           SEARCH HOUROFAPP AT END SET DAYIDX UP BY 1
               WHEN APPOINTMENTTYPE = APPOINTMENT(DAYIDX, HOURIDX)
                   SET APPOINTMENTFOUND TO TRUE
                   SET HOURSUB TO HOURIDX
                   SET DAYSUB TO DAYIDX
                   DISPLAY APPOINTMENTTYPE " IS ON " DAYNAME(DAYSUB)
                   DISPLAY "AT " TIMEVALUE(HOURSUB) " IN " LOCATION(DAYIDX, HOURIDX)
           END-SEARCH
       END-PERFORM
       IF APPOINTMENTNOTFOUND
           DISPLAY "APPOINTMENT " APPOINTMENTTYPE " WAS NOT IN THE TIMETABLE"
       END-IF
       STOP RUN.
