IDENTIFICATION DIVISION.
PROGRAM-ID. LISTING11-7.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
       SELECT CENSUSFILE ASSIGN TO "CensusFile.dat"
           ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD CENSUSFILE.
01 CENSUSREC.
       88 ENDOFCENSUSFILE VALUE HIGH-VALUES.
       02 RECNUM       PIC 9(7).
       02 STATENUM     PIC 99.
       02 AGECAT       PIC 9.
       02 GENCAT       PIC 9.
       02 CAROWN       PIC X.

WORKING-STORAGE SECTION.

01 USPOPTABLE.
       02 STATE OCCURS 50 TIMES.
           03 AGECATE OCCURS 3 TIMES.
               04 GENCATE OCCURS 2 TIMES.
                   05 POPTOTAL  PIC 9(8).

01 STATEIDX    PIC 99.
01 AGEIDX      PIC 9.
01 GENIDX      PIC 9.

PROCEDURE DIVISION.
BEGIN.
       OPEN INPUT CENSUSFILE
       READ CENSUSFILE
           AT END SET ENDOFCENSUSFILE TO TRUE
       END-READ
       PERFORM UNTIL ENDOFCENSUSFILE
           ADD 1 TO POPTOTAL(STATENUM, AGECAT, GENCAT)
           READ CENSUSFILE
               AT END SET ENDOFCENSUSFILE TO TRUE
           END-READ
       END-PERFORM

       CLOSE CENSUSFILE.

       PERFORM DISPLAYCOUNT VARYING STATEIDX FROM 1 BY 1 UNTIL STATEIDX GREATER THAN 50
               AFTER AGEIDX FROM 1 BY 1 UNTIL AGEIDX GREATER THAN 3
               AFTER GENIDX FROM 1 BY 1 UNTIL GENIDX GREATER THAN 2
       STOP RUN.

DISPLAYCOUNT.
       DISPLAY "STATISTIC FOR STATEIDX: " STATEIDX " AGETIDX: " AGEIDX " GENIDX: " GENIDX
       DISPLAY "NUMBER OF PEOPLE: " POPTOTAL(STATEIDX, AGEIDX, GENIDX).
