IDENTIFICATION DIVISION.
PROGRAM-ID. LISTING15-2.

DATA DIVISION.
WORKING-STORAGE SECTION.
01     TEXTLINE        PIC X(80).

01     LETTERS         PIC X(26) VALUE  "ABCDEFGHIJKLMNOPQRSTUVWXYZ".

01     LETTERPOS       PIC 99.

01     LETTERCOUNT     PIC 99.

01     PRNLETTERCOUNT  PIC Z9.

PROCEDURE DIVISION.
BEGIN.
       DISPLAY "ENTER A TEXT : " WITH NO ADVANCING
       ACCEPT TEXTLINE
       PERFORM VARYING LETTERPOS FROM 1 BY 1 UNTIL LETTERPOS > 26
           MOVE ZEROS TO LETTERCOUNT
           INSPECT FUNCTION UPPER-CASE(TEXTLINE)
               TALLYING LETTERCOUNT FOR ALL LETTERS(LETTERPOS:1)
           IF LETTERCOUNT > ZEROS
               MOVE LETTERCOUNT TO PRNLETTERCOUNT
               DISPLAY "LETTER " LETTERS(LETTERPOS:1) " OCCURS " PRNLETTERCOUNT " TIMES"
           END-IF
       END-PERFORM
       STOP RUN.
