IDENTIFICATION DIVISION.
PROGRAM-ID. LISTING15-1.

DATA DIVISION.
WORKING-STORAGE SECTION.
01     TEXTLINE        PIC X(80).

01     LOWERCASE       PIC X(26)  VALUE  "abcdefghijklmnopqrstuvwxyz".

01     UPPERCASE       VALUE  "ABCDEFGHIJKLMNOPQRSTUVWXYZ".
       02  LETTER      PIC X OCCURS 26 TIMES.

01     IDX             PIC 99.

01     LETTERCOUNT     PIC 99.

01     PRNLETTERCOUNT  PIC Z9.

PROCEDURE DIVISION.
BEGIN.
       DISPLAY "ENTER TEXT: - " WITH NO ADVANCING
       ACCEPT TEXTLINE
       INSPECT TEXTLINE CONVERTING LOWERCASE to UPPERCASE

       PERFORM VARYING IDX FROM 1 BY 1 UNTIL IDX > 26
           MOVE ZEROS TO LETTERCOUNT
           INSPECT TEXTLINE TALLYING LETTERCOUNT FOR ALL LETTER(IDX)
           IF LETTERCOUNT > ZEROS
               MOVE LETTERCOUNT TO PRNLETTERCOUNT
               DISPLAY "LETTER " LETTER(IDX) " OCCURS " PRNLETTERCOUNT " TIMES"
           END-IF
       END-PERFORM
       STOP RUN.
