IDENTIFICATION DIVISION.
PROGRAM-ID. LISTING15-3.

DATA DIVISION.
WORKING-STORAGE SECTION.

01     TEXTLINE            PIC X(80).

01     VOWELCOUNT          PIC 99          VALUE ZERO.

01     CONSONANTCOUNT      PIC 99          VALUE ZERO.

PROCEDURE DIVISION.
BEGIN.
       DISPLAY "ENTER TEXT: " WITH NO ADVANCING
       ACCEPT TEXTLINE
       INSPECT FUNCTION UPPER-CASE(TEXTLINE) TALLYING
           VOWELCOUNT FOR ALL "A" "E" "I" "O" "U"
           CONSONANTCOUNT FOR ALL "B" "C" "D" "F" "G" "H" "J" "K" "L" "M" "N" "P"
                                  "Q" "R" "S" "T" "V" "W" "X" "Y" "Z"
       DISPLAY "THE LINE CONTAINS " VOWELCOUNT " VOWELS AND " CONSONANTCOUNT " CONSONANTS."
       STOP RUN.
