IDENTIFICATION DIVISION.
PROGRAM-ID. LISTING11-2.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
       SELECT BRANCHSALESFILE ASSIGN TO "BranchSales2.dat"
           ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD     BRANCHSALESFILE.
01     BRANCHSALESREC.
       88 ENDOFSALESFILE       VALUE HIGH-VALUES.
       02 BRANCHID             PIC 9(7).
       02 STATENUM             PIC 99.
       02 CANDYSALES           PIC 9(7)V99.

WORKING-STORAGE SECTION.
01     STATESALESTABLE.
       02 STATETOTALS OCCURS 50 TIMES.
           03 STATESALESTOTAL  PIC 9(8)V99.
           03 STATEBRANCHCOUNT PIC 9(5).

01     STATEIDX                PIC 99.

01     REPORTHEADING1          PIC X(35) 
           VALUE "     YORECANDYSHOPPE SALES BY STATE".
01     REPORTHEADING2          PIC X(35)
           VALUE "     ------------------------------".
01     REPORTHEADING3          PIC X(47)
           VALUE "STATE   BRANCHES     STATESALES    AVERAGESALES".

01     DETAILLINE.
       02 PRNSTATENUM          PIC BZ9.
       02 PRNBRANCHCOUNT       PIC B(3)ZZ,ZZ9.
       02 PRNSTATESALES        PIC B(5)$$$,$$$,$$9.99.
       02 PRNAVERAGESALES      PIC BB$$$,$$$,$$9.99.

01     US-TOTALS.
       02 US-TOTALSALES        PIC 9(9)V99.
       02 US-BRANCHCOUNT       PIC 9(6).
       02 PRNUS-TOTALSALES     PIC $,$$$,$$$,$$9.99.
       02 PRNUS-BRANCHCOUNT    PIC B(9)ZZZ,ZZ9.
       02 PRNUS-AVERAGESALES   PIC BB$$$,$$$,$$9.99.

PROCEDURE DIVISION.
BEGIN.
       MOVE ZEROS TO STATESALESTABLE
       OPEN INPUT BRANCHSALESFILE
       READ BRANCHSALESFILE
           AT END SET ENDOFSALESFILE TO TRUE
       END-READ
       PERFORM UNTIL ENDOFSALESFILE
           ADD CANDYSALES TO STATESALESTOTAL(STATENUM), US-TOTALSALES
           ADD 1 TO STATEBRANCHCOUNT(STATENUM), US-BRANCHCOUNT
           READ BRANCHSALESFILE
               AT END SET ENDOFSALESFILE TO TRUE
           END-READ
       END-PERFORM
       PERFORM PRINTRESULTS

       CLOSE BRANCHSALESFILE
       STOP RUN.

PRINTRESULTS.
       DISPLAY REPORTHEADING1
       DISPLAY REPORTHEADING2
       DISPLAY REPORTHEADING3
       PERFORM VARYING STATEIDX FROM 1 BY 1
               UNTIL STATEIDX GREATER THAN 50
           MOVE STATEIDX TO PRNSTATENUM
           MOVE STATESALESTOTAL(STATEIDX) TO PRNSTATESALES
           MOVE STATEBRANCHCOUNT(STATEIDX) TO PRNBRANCHCOUNT
           COMPUTE PRNAVERAGESALES = STATESALESTOTAL(STATEIDX) / STATEBRANCHCOUNT(STATEIDX)
           DISPLAY DETAILLINE
       END-PERFORM
       MOVE US-TOTALSALES TO PRNUS-TOTALSALES
       MOVE US-BRANCHCOUNT TO PRNUS-BRANCHCOUNT
       COMPUTE PRNUS-AVERAGESALES = US-TOTALSALES / US-BRANCHCOUNT
       DISPLAY "YORECANDYSHOPPE BRANCHES IN THE US = " PRNUS-BRANCHCOUNT
       DISPLAY "YORECANDYSHOPPE SALES IN THE US    = " PRNUS-TOTALSALES
       DISPLAY "YORECANDYSHOPPE AVERAGE US SALES   = " PRNUS-AVERAGESALES.
