IDENTIFICATION DIVISION.
PROGRAM-ID. LISTING6-3.

DATA DIVISION.
WORKING-STORAGE SECTION.
01     REPCOUNT        PIC 9(4).
01     PRNREPCOUNT     PIC Z,ZZ9.
01     NUMBEROFTIMES   PIC 9(4)    VALUE 1000.

PROCEDURE DIVISION.
BEGIN.
       PERFORM VARYING REPCOUNT FROM 0 BY 50
           UNTIL REPCOUNT = NUMBEROFTIMES
       MOVE REPCOUNT TO PRNREPCOUNT
       DISPLAY "COUNTING " PRNREPCOUNT
       END-PERFORM

       MOVE REPCOUNT TO PRNREPCOUNT
       DISPLAY "IF I HAVE TOLD YOU ONCE, "
       DISPLAY "I'VE TOLD YOU " PRNREPCOUNT " TIMES."
       STOP RUN.
