IDENTIFICATION DIVISION.
PROGRAM-ID. LISTING6-7.

DATA DIVISION.
WORKING-STORAGE SECTION.
01     PERSON-NAME     PIC X(20)   VALUE   SPACES.
01     STARTVALUE      PIC 99      VALUE   ZEROS.
01     COUNTER         PIC 99      VALUE   ZEROS.

PROCEDURE DIVISION.
BEGIN.
       DISPLAY "ENTER YOUR NAME - " WITH NO ADVANCING
       ACCEPT PERSON-NAME
       DISPLAY "ENTER THE COUNT-DOWN START VALUE - " WITH NO ADVANCING
       ACCEPT STARTVALUE

       PERFORM VARYING COUNTER FROM STARTVALUE BY -1 UNTIL COUNTER = 0
       DISPLAY COUNTER
       END-PERFORM
       
       DISPLAY PERSON-NAME

       STOP RUN.

